---
title: Virtual Function Table
author: Mao Song
date: 2023-05-10
math:  false
mermaid: false
img_path: /assets/images/
categories: [programming]
tags: [c++]
---

这篇博客介绍了多态的实现原理以及虚函数表在多态中的作用。

# Introduction
面向对象语言的三大特性：
- 继承(inheritance)
- 封装(enclose)
- 多态(polymorphism)

其中多态的内在机制就是：编译器在运行时根据变量的实际类型采取相对应的行动（调用对应的函数）。而在C++中多态的实现就依赖于虚函数表，这篇博客就记录了学习虚函数表的过程，大部分都是根据之前其他人的笔记整理得到的。


# Method
我们首先查看虚函数在内存中的布局情况：
```c++
// main.cpp
class Normal
{
public:
 void func1(){};
 void func2(){};
};

class Base {
  virtual void func1(){};
  virtual void func2(){};
};

class Derived: public Base{
  virtual void func1() override{};
};

int main() {
  Normal *normal_ptr = new Normal();
  Base *base_ptr = new Base();
  Base *derived_ptr = new Derived();
  return 0;
}
```
使用如下命令编译运行以上代码得到：
```shell
$ clang -cc1 -fdump-record-layouts -stdlib=libc++ main.cpp
*** Dumping AST Record Layout
         0 | class Normal (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class Base
         0 |   (Base vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Derived
         0 |   class Base (primary base)
         0 |     (Base vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]
```
可以看到，相比于没有`virtual`函数的`Normal`， `Base`类的起始位置多了一个`Base vtable pointer`， 这就是`Base`类的指向虚函数表的指针。

> `Normal`的大小不为0的原因是C++不允许有两个不同的对象的地址是一致的，因此一个(空)类的大小(`sizeof`)至少为1.
{: .prompt-info }

我们可以进一步使用如下命令查看虚函数表
```shell
$ clang -Xclang -fdump-vtable-layouts -stdlib=libc++ -c main.cpp
Original map
Vtable for 'Base' (4 entries).
   0 | offset_to_top (0)
   1 | Base RTTI
       -- (Base, 0) vtable address --
   2 | void Base::func1()
   3 | void Base::func2()

VTable indices for 'Base' (2 entries).
   0 | void Base::func1()
   1 | void Base::func2()

Original map
 void Derived::func1() -> void Base::func1()
Vtable for 'Derived' (4 entries).
   0 | offset_to_top (0)
   1 | Derived RTTI
       -- (Base, 0) vtable address --
       -- (Derived, 0) vtable address --
   2 | void Derived::func1()
   3 | void Base::func2()

VTable indices for 'Derived' (1 entries).
   0 | void Derived::func1()
```

实际上，在含有`virtual`函数的类编译期间，编译器会在该类的起始位置添加一个指向虚函数表的指针，虚函数表里存储了虚函数的地址。其具体结构如下所示：
![](assets/images/2023-05-10/vtable1.png)

> 除了虚函数信息外，vtable里还包含了RTTI的信息，关于RTTI可以参考之前的[博客](https://maosong2022.github.io/posts/RTTI/)
{: .prompt-info }

最后，我们总结虚函数表在内存中的位置分布
![](assets/images/2023-05-10/memory.png)
其中，对象指针即代码中的`normal_ptr`, `base_ptr`和`derived_ptr`； 类虚函数表即`vtable for Base`和`vtable for Derived`; 虚函数表即上图最右侧的`code`

# Remark
有几点需要注意的是：
- vptr是在何时被初始化的？由于vptr是一个实例，因此vptr在类的构造函数中被初始化。这也意味着构造函数不能作为虚函数(因为是先调用构造函数，才有虚函数表)
- vtable是在何时被创建的？这个问题参考文献里通过汇编代码给出了答案：
> 编译器在编译器就为每个类确定了vtable的内容，并且在构造函数中添加了相应代码，使得vptr能够指向正确的vtable的地址
- 调用虚函数的流程？
> 首先通过位于栈区的指向类的实例的指针找到位于堆区的实例的地址，然后通过实例内存开头的vptr找到位于只读数据区`.rodata`里的vtable，再根据vtable里的index找到对应的函数，最后跳转到代码区`.text`中对应的虚函数代码。这部分详细内容可以参考[FAQ](http://www.dietmar-kuehl.de/mirror/c++-faq/virtual-functions.html).

# Reference
https://www.zhihu.com/question/389546003/answer/1194780618
https://pabloariasal.github.io/2017/06/10/understanding-virtual-tables/
https://jasonblog.github.io/note/c++/tan_suo_c_xu_han_shu_zai_g_zhong_de_shi_xian.html
http://www.dietmar-kuehl.de/mirror/c++-faq/virtual-functions.html
